[
    {
      "title": "Jo mujh par durud padhna bhul gaya woh jannat ki rah bhul gaya!",
      "subtitle": "صلی اللہ علیہ والہ وسلم(Swallellaho alayhi wa aalihi wa sallam)",
      "hawala" : ""
    },
    {
      "title": "Allah ke Rasul(ﷺ) ne irshad farmaya - Amaal ke daromdar niyaton par hai.",
      "subtitle": "قَلَ رَسُوْلُ اللهِ ﷺ اللہ کے رسول (ﷺ)  نے ارشاد فرمایا  - اِنَّمَا الْاَعْمَالُ بِالنِّيَاتِ (اعمال کا دارومدار نیتوں پر ہے)",
      "hawala":"Bukhari(بخاری) sharif"
    },
    {
      "title": "Allah ke Rasul(ﷺ) ne irshad farmaya - Paakizgi adha imaan hai.",
      "subtitle": "قَلَ رَسُوْلُ اللهِ ﷺ اللہ کے رسول (ﷺ)  نے ارشاد فرمایا  - اَطُّهُوْرُ شَطْرُ الْاِمَانِ(پاکیزگی آدہا امیان ہے)",
      "hawala":"Muslim(مسلم) sharif"
    }, 
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Miswak munh ki safayi aur rab ki khusnudi ka zariya hai.",
      "subtitle":"قَلَ رَسُوْلُ اللهِ ﷺ اللہ کے رسول (ﷺ)  نے ارشاد فرمایا - اَلسِّوَاكُ اَطْهَرَةٌ لِّلْفَمِ مَرْ ضَاةٌ لِّلرَّبِّ(مسواک منہ کی صفائ اور رب کی خوشنودی کا زاریعہ ہے)",
      "hawala": "Bukhari(بخاری) sharif"
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Wuzu nmaaz ki kunji hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Namaaz deen ka sutun hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Namaaz momineen ki mi'raaz hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Tilawat e Quran bahtarin ibadat hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Saaf raho kiunki islaam safayi wala mazhab hai",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Beshak Allah ta'ala jamil hai aur jamaal ko pasand karta hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Sharm wo haya imaan ka hissa hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Jhut rizq ko kam kar deta hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Subah ka sona rizq ko rok deta hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Zyada hansnaa dil ko murdah kar deta hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Beshak hasad nekion ko kha jata hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Chughal khor jannat me nahi jayega.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Ghibat karna qatal se badtar hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Ilm e din hasil karna har musalman mard wo aurat par farz hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Rizq-e halal hasil karna har musalman par farz hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Tumme achhe insaan woh hai jiski ikhlaq achhe ho.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Achha ikhlaq adha din hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Baap jannat ke darwazon mein beech ka darwaza hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Jannat maaon ke qadmon tale hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Aapas me salam ko failao.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Baat karne se pahle salam karo.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Jab ghar me aaon to ghar walon ko salam karo.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Musafah kia karo kinah dur hota hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Bismillah padho aur daien haat se khao.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Paani dekh kar pio.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Jab pie to daien haat se pie.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Roti ki ezzat karo.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Apne mahman ki ezzat karo.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Padhosi ka haq hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Jo badhon ki ezzat na kare woh ham me se nahi.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Allah ta'ala us aadmi par raham nahi farmata jo logon par raham nahi karta.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Raat ko na khana kamzor karta hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Jannat Jannat Shakhawat karni walon ka ghar hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Kanjus jannat me nahi jayega.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Bazzar me khana bura hai.",
      "subtitle":"",
      "hawala": ""
    },
    {
      "title":"Allah ke Rasul(ﷺ) ne irshad farmaya - Madina sharif ki dhul kodh ke lie sifa hai.",
      "subtitle":"",
      "hawala": ""
    }
  ]
  