{
    "items" :[
        {
            "topic": "Wuzu",
            "sawal": "Wuzu karne ka Tariqa kia hai?",
            "jawab": "Wuzu karne ka Tariqa ye hai ki \n - Pahle bismillahir rahmanir rahim(بسم اللہ الرحمن الرحیم)padhe. \n - Fir miswak kare, miswak na ho to ungli se daant meil le\n - Fir dono haaton ko gatto tak tin baar dhoe. Pahle dahne haath par paani daale fir baaein haath par. dono ko ek sath na dhoe. \n - Fir dahne haath dahne haath se tin baar kulli kare. \n - Fir baaien haath ki choti ungli naak saaf kare. aur dahne haath se tin baar naak me paani chadhae. \n - Fir pura chahra dhoe. yani Peshani par bal ugne ki jagah se thodhi ke niche tak aur ek kaan ki lo se dusre kaan ki lo tak har hisse par tin baar pani bahaye. \n - Iss ke baad dono haath kauhnion samet tin baar dhoe. Unglion ki taraf se kauhnion ke upar tak paani dale. Kahnion ki taraf se na dale.\n - Fir ek baar dono haath se pure sar ka masah kare fir kaano ka aur gardan ka ek ek baar masah kare.\n - Fir dono paaon takhno samet tin baar dhoe.",
            "hawala": "انوار شريعت, درمختار، ج:۱"
        },
        {
            "topic": "Wuzu",
            "sawal": "Dhone ka matlab kya hai?",
            "jawab": "Dhone ka matlab ye hai ki jis cheez dhoe uss ke har hisse par paani bah jaaye.",
            "hawala": "فتاویٰ عالمگيری,انوار شريعت"
        },
        {
            "topic": "Wuzu",
            "sawal": "Agar kuch hissa bhig gaya magar uss par paani nahi baha to wuzu hoga ya nahi?",
            "jawab": "Iss tarah wuzu hargiz na hoga, bhigne ke sath har hisse par paani bah jana zaruri hai.",
            "hawala":"انوار شريعت"
        },
        {
            "topic": "Wuzu",
            "sawal": "Wuzu me kitne chize farz hai?",
            "jawab": "Wuzu me char(four) cheeze farz hai. \n\t\t 1. Awwal munh dhona yaani baal nikalne ki jagah se thodi ke niche tak aur ek kaan ke lo se dusre kaan ke lo tak. \n\t\t 2. Kauhnia samet dono haath dhona. \n\t\t 3. Chauthayi(1/4 hissa) sar masah karna, yaani bhiga hua haath ferna. \n\t\t 4. Dono paaon takhno samet dhona",
            "hawala":"انوار شريعت"
        },
        {
            "topic": "Wuzu",
            "sawal": "Wuzu me kitne sunnate hai?",
            "jawab": "Wuzu me sunnate 16 hai. \n\t\t 1. Niyyat karna \n\t\t 2. Bismillahir rahmanir rahim(بسم اللہ الرحمن الرحیم) se suru karna \n\t\t 3. Dono haatho ko gatto tak tin baar dhona,  \n\t\t 4. Miswak karna \n\t\t 5. Dahne haat se tin bar kullian karna \n\t\t 6. Dahne haath ne tin baar naak me paani chadhana. \n\t\t 7. Baaien haath se naak saf karna \n\t\t 8. Daardhi ka khilal karna \n\t\t 9. Haath paaon ki unglion ka khilal karna \n\t\t 10. Har aaza ko tin baar dhona \n\t\t 11. Pura sar ka ek baar masah karna \n\t\t 12. Kaanon ka masah karna. \n\t\t 13. Tartib se wuzu karna \n\t\t 14. Dadhi ke jo baal munh ke daire ke niche hai un ka masah karna  \n\t\t 15. Aaza ko pe dar pe dhona  \n\t\t 16. Har makruhaat se bachna",
            "hawala":"انوار شريعت"
        },
        {
            "topic": "Wuzu",
            "sawal": "Wuzu me kitni baate makruh hai?",
            "jawab": "Wuzu me 21 baatei makruh hai: \n\t\t 1. Aurat ke ghusal ya wuzu ke bache hue paani se wuzu karna. \n\t\t 2. Wuzu ke lie najis jagah baithna.\n\t\t 3. Najis jagah wuzu ke paani girana. \n\t\t 4. Masjid ke andar wuzu karna. \n\t\t 5. Wuzu ke aaza se bartan me paani ke qatre tapkana \n\t\t 6. Paani me rainth ya khankar dalna. \n\t\t 7. Qiblah ki taraf thuk ya khankar dalna ya kulli karna \n\t\t 8. Be zarurat dunia ki baat karna. \n\t\t 9. Zarurat se jyada paani kharch karna. \n\t\t 10. Paani iss qadar kam kharch ki sunnat ada na ho. \n\t\t 11. Munh par paani marna. \n\t\t 12. Munh par paani dalte waqat phunkna. \n\t\t 13. Sirf ek haath se munh dhona. \n\t\t 14. Gale ka masah karna. \n\t\t 15. Baaein haath se kulli karna ya naak me paani dalna. \n\t\t 16. Dahne haath se naak saf karna. \n\t\t 17. Apne lie koi lota wageirah khas kar lena. \n\t\t 18. Tin naye paani se tin baar sar ka masah karna. \n\t\t 19. Jis kapdhe se istinja ka paani khusk kia ho usse aazaye wuzu pochna. \n\t\t 20. Dhup ke garam paani se wuzu karna. \n\t\t 21. Kisi sunnat ko chhodh dena.",
            "hawala": "بہار شريعت,انوار شريعت"
        },
        {
            "topic": "Wuzu",
            "sawal": "Kin Cheezon se wuzu tut jata hai?",
            "jawab": "Jin baaton se wuzu tut jata hai wo ye hai: \n\t\t - Pakhana ya peshab karna. \n\t\t - Pakhana peshab ki raste se kisi aur cheez ka nikalna. \n\t\t - Pakhane ke raste se hawa ka nikalna. \n\t\t - Badan ke kisi maqam se khun ya peep nikal kar aisi jagah bahna ki jis ka wuzu ya gusal me dhona farz hai. \n\t\t - Khana, pani ya safara ki munh bhar qay ana. \n\t\t - Iss tarah so jana ki jisam ke jodh dhile padh jaye. \n\t\t - Behosh hona. \n\t\t - Junun hona. \n\t\t - Ghashi hona. \n\t\t - Kisi cheez ka itna nasha hona ki chlne me paon ladkhadae. \n\t\t - Ruku aur sajdah wali namaz mei itni zor se hansna ki aas paas wale sune. \n\t\t - Dukhti aankh se aansu bahna.",
            "hawala":"انوار شريعت"
        },
        {
            "topic": "Ghusal",
            "sawal": "Kin surton mei ghusal karna farz hai?",
            "jawab": "\t1. Mani ka apni jagah se shohobat ke sath juda ho kar aaza(sharm gah) se nikalna. \n\t2. Ehtelaam \n\t3. Hashfah yaani sar zakar(sharam gah) ka aurat ke aage ya piche ya mard ke piche dakhil hona dono par ghusal farz karta hai. \n\t4. Haiz se faarig hona. \n\t5. Nifaas ka khatam hona.",
            "hawala": "انوار شريعت"
        },
        {
            "topic": "Ghusal",
            "sawal": "Ghusal mei kinti baatei farz hai?",
            "jawab": "Ghusal me tin baatei farz hai- \n\t\t1. Kulli karna. \n\t\t2. Naak me paani dalna. \n\t 3. Tamaam Zahiri badan par sar se paaon tak paani bahana",
            "hawala": "انوار شريعت, درمختار، ج:۱"
        },
        {
            "topic": "Ghusal",
            "sawal": "Ghusal karne ka Triqah kia hai?",
            "jawab": "Ghusal karne ka Tariqah yeh hai ki pahle ghusal ki niyyat kar ke dono haat gatto tak tin baar dhoe. Fir istinja ki jagah dhoe. Uss ke baad badan par agar kahi najasat haqiqi yaani peshab ya pakhana wageirah ho to use dur kare. Fir namaaz jaisa wuzu kare magar paon na dhoe. Haan agar chauki(chair) ya patthar wageirah unchi cheez par nahaye to paaon bhi dho le. \n Iss ke baad badan par tel(oil) ki tarah paani chadhaye. Fir tin baar daine kandhe(right shoulder) paani bahaye, aur fir tin bar baayen kandhe(left shoulder) par, fir sar par. \n Aur tamaam badan par tin baar paani bahaye. Tamaam badan par hath phere aur mal-le(rubbing). Phir nahane ke baad fauran kapdhe pahenle.",
            "hawala": "فتاویٰ عالمگيری,انوار شريعت"
        }, 
        {
            "topic": "Ghusal",
            "sawal": "Ghusal mei kitni baatei sunnat hai?",
            "jawab": "Ghusal mei ye baatei sunnat hai: \n 1: Ghusal ki niyyat karna, \n2: Dono hathon ko gatto tak tin baar dhona. \n3: Istinja ki jagah dhona. \n4: Badan par jahan kahi najaasat ho use dur karna. \n5: Namaaz jaisa wuzu karna, \n6: Badan par teil ki tarah paani chadhana. \n7: Daine maudhe fir baaien maudhe fir sar par aur tamaam badan par tin baar paani bahana. \n8: Tamaam badan par haath pherna aur meilna(rubbing) \n9: Nahane me qiblah rukh na hona. Aur kapdha pahan kar nahata ho to koi harj nahi. \n10: Aisi jagah nahana ki koi na dekhe. \n11: nahate waqat kisi qisam ka kalam na ka karna. \n12: Koi dua na padhna. \n13: Auraton ko baith kar nahana. \n14: Nahane k baad fauran kapdha pahen lena.",
            "hawala": "فتاویٰ عالمگيری,انوار شريعت"
        },
        {
            "topic": "Ghusal",
            "sawal": "Kin waqton me ghusal karna sunnat hai?",
            "jawab": "Juma, Eid, Baqara eid, Aarafa ke din, aur ahraam bandhte waqt",
            "hawala": "فتاویٰ عالمگيری,انوار شريعت"
        },
        {
            "topic": "Ghusal",
            "sawal": "Kin Surton me ghusal karna mustahab hai?",
            "jawab": "Waquf e aarafa, Waquf e muzdalfa, Hazir e haram, Hazir e sarkare do aalam (صلی اللہ تعالی علیہ وسلم), Tawaf, dakhil e Mina tino jamron par kankaria marne ke lie. Shab e barat, Shab e qadar, aarafah ki raat, Majlis e milaad sharif, aur digar majlis khair ki haŻiri ke lie, Murdah nahlane ke baad, Majnun ko junun jane ke baad, ghashi se afaqah ke baad, nasha jaate rahne ke baad, gunahon se tauba karne ke lie, naya kapdha pahenne ke lie, safar se wapis ke baad, istehaza bandh hone ke baad, namaaz kasuf khusuf, istasqa, khauf, taariki aur sakht andhi ke lie, badan par najasat lagi ho aur ye na malum ho ki kis jagah hai.\n - In sab surton me ghusal karna mustahab hai.\n\t. NB: 1. Ghutna khol kar logon ke saamne nahaana sakht gunah aur haraam hai. \n\t2. Najis kapdha pahenkar ghusal na kare. Aur agar dusra paak kapdha na ho to usiko paak karle.",
            "hawala": "انوار شريعت"
        },
        {
            "topic": "Faraiz",
            "sawal": "Namaz me kitne faraiz hai?",
            "jawab": "Namaz me 7 faraiz hai.",
            "hawala": "hawala"
        },
        {
            "topic": "Makruhat",
            "sawal": "Manaz me dihar udher dekhna kia hai",
            "jawab": "Makruh hai",
            "hawala": "jawab"
        },
        {
            "topic": "Fasid",
            "sawal": "Kin chizon se namaz tut jati hai",
            "jawab": "Jawab1",
            "hawala": "hawala"
        },
        {
            "topic": "Fazilat",
            "sawal": "fazilat 1",
            "jawab": "hadis",
            "hawala": "hawala"
        },
        {
            "topic": "Qaza Namaz",
            "sawal": "Umar bhar ki qaza kaise ada kare",
            "jawab": "Jawab1",
            "hawala": "hawala"
        },
        {
            "topic": "Bimar ki Namaz",
            "sawal": "Bimari ki surat me namaz kaise padhe?",
            "jawab": "Jawab1",
            "hawala": "hawala"
        },
        {
            "topic": "Sajda Sahu",
            "sawal": "Sajda Sahu kise kahte hai?",
            "jawab": "Jawab1",
            "hawala": "hawala"
        },
        {
            "topic": "Sajdah Tilawat",
            "sawal": "Sajdah Tilawat kise kahte hai",
            "jawab": "Jawab1",
            "hawala": "hawala"
        }
    ]
}