{
    "items": [
      {
        "id": "sb1",
        "category": "Quran",
        "title": "Quran e Karim ye Mubarak Raat ki Zikar",
        "details": "[اِنَّاۤ اَنْزَلْنٰهُ فِیْ لَیْلَةٍ مُّبٰرَكَةٍ اِنَّا كُنَّا مُنْذِرِیْنَ(۳) فِیْهَا یُفْرَقُ كُلُّ اَمْرٍ حَكِیْمٍۙ(۴)] \n(ترجَمہ کنزُ العرفان : بیشک  ہم نے اسے برکت  والی  رات میں اتارا ، بیشک ہم ڈر سنانے والے ہیں  اس رات میں  ہر حکمت والا کام بانٹ دیا جاتا ہے ۔)\n\nان آیاتِ کریمہ میں ایک مُبارَک رات کا ذِکْر کیا گیا اور بتایا گیا ہے کہ اس رات میں ہر )حکمت والا کام بانٹ دیا جاتا ہے۔ اس مَقام پر اس مُبارَک رات سے کون سی رات مُراد ہے ، اس بارے میں مُفَسِّرِیْنِ کرام کے2 اَقْوال ہیں )\n\tIn Aayat me ek mubaarak raat ka zikar kia gaya aur bataya gaya hai ki is raat mai har hikmat wala kam baant dia jata hai. Iss maqam par uss mubaarak raat se kon si raat murad hai, mufassarin kiram ke 1 aqwal hai. \n 1. Ek qol to ye hai ki iss se murad Shab e qadar hai. Jo har saal ramdan ul mubaarak me aati hai. Isi mubaarak raat me quraan e karim naazil hua aur isi raat mai har hikmat wala kam bant dia jata hai. \n\t2. Dusra qol ye hai ki iss se nisfe Shaban ki raat yaani Shab e Baraat muraad hai.",
        "hawala": "SHAB E BARAT KE FAZAIL - Dawat e Islami"
      },
      {
        "id": "sb1",
        "category": "Fazail",
        "title": "Shab e Barat Ki Raat ki Fazail",
        "details":"Kaha gaya Hai Aasmaan Ke farishton ke liye Do raaten Eid aur Musarrat Ki Hai Jaise Duniya Mein musalmanon ke liye Eid ki do raaten  Eid O Musarrat Ki Hai. Fariston ki Eidraat barat ki raat yaani pandrah Shawan ki raat aur Lailatul Qadar hai. Aur Mominoon ki Eid UL Fitr aur Eid Ul Azha ki raatein hai. Isilie 15 Shawan ki raat ko Firiston ki Eid raat ka naam dia gaya hai. Allama Subuki Rahmatullah Alayhi ne iss call ki tafsir me kaha hai ki ye raat Saal bhar ki gunah ka kaffara banti hai. Jumerat hafta ki gunahoka kaffara aur lailatul Qadar Umra bhar ki gunahoka kaffara hoti hai, yani in raaton me Allah tala ki ebaadat karna aur yade ilahi me sari raat jag kar gujar dena gunahoke kaffara ka sabab hota hai. Isi lie is raat to kaffara ki raat bhi kaha jata hai. Aur ise zindagi ki raat bhi kaha jata hai. Is lie ki  is raat to kaffara ki raat bhi kaha jata hai. Aur ise zindagi ki raat bhi kaha jata hai. Is lie ki Al Munjari ne ye hadis naqal ki hai ki jisne do Eid ki raatein aur 15 Shawan ki raat jag kar guzar di to aise din me jabki tamaam dil mar jayenge uska dil nahi marega. ",
        "hawala": "Mukashfatul Qulub: Huzzatul Islam Imaam Mohammad Gazaali"
      },
      {
        "id": "sb2",
        "category": "Hadis",
        "title": "Shab e barat me kya hota hai?",
        "details": "Huzur e Aqdas(ﷺ)  ne Hazrat e Ayesha Siddiqa(رضی اللہ تعالی عنہا) se farmaya tum janti ho iss raat me kya hota hai? Unhone arz kia ya RasulAllah(ﷺ) kya hota hai? Farmaya iss raat me saal ka har paida hone wala aur har marne wala aadmi likha jata hai. Aur logoke aamal unke rab ki bargah me pesh hote hai. Aur Unke rizq utare jate hai.",
        "hawala": "Behqi Sharif"
      },
      {
        "id": "sb2",
        "category": "Hadis",
        "title": "Shab e barat me kiski Bkhsish nahi hoti?",
        "details": "Huzur e paak(ﷺ) ne farmaya ye Humera[yani Hazrat e Ayesha Siddiqa(رضی اللہ تعالی عنہا)], kya tum nahi janti ki 15 Shawan ki raat hai, is raat me Allah taala banu kalb ki rebdo ki baalo ki barabar logoko aag se azad farmata hai. Magar 6 admi isse bhi mehrun rahte hai. \n\t1. Sharab khor, \n\t2. Waleden ki nafarmaan, \n\t3. Aadi zani, \n\t4. Qatay raham, \n\t5. Chang o rabaw bajane wala, \n\t6. Chugalkhor. \nEk riwayat me rabaw bajane wale ki jagah musabbir ki lafz hai.",
        "hawala": "Behqi Sharif"
      },
      {
        "id": "sb2",
        "category": "Amal",
        "title": "14 Shawan ul muazzam baad namaz e asr k bad",
        "details": "14 Shawan ul muazzam baad namaz e asr ye zikar kare:\n\n \t 70 Times: (اَسْتَغْفِرُ اللّٰهَ رَبِّ مِنْ كُلِّ ذَنْبٍ وَّ اَتُوْبُ اِلَيْهِ) \n\t*40 TImes: (لاَ حَوْلَ وَلَا قُوَّةَ اِلَّا بِا لِلّٰهِ الْعَلِىِّ الْعَظِيْمِ).\n \t*100 Times: (صلی اللہ تعالی علیہ وسلم)[ya koi darud sharif bhi pad sakte hain]",
        "hawala": ""
      },
      {
        "id": "sb3",
        "category": "Fazail",
        "title": "Sab e Barat ki raat me rahmat e elaahi",
        "details": "Rasul e Akram(ﷺ) ne irshaad farmaya hai ki Allah(عزوجل) shab e barat me meri ummat par banu kalb ki bakrion ke baalon ke barabar rahmat e nazil farmata hai.(Banu kalb Arab me ek Qabilah tha, un ke yehan bakrian kasrat se thi).",
        "hawala": " Tafseer e kabir"
      },
      {
        "id": "sb3",
        "category": "Fazail",
        "title": "Sab e Barat ki raat me Musalmano ki maghfirat",
        "details": "Sarkare Madina(ﷺ) ne irshaad farmayen ki haq tabarak o ta'ala(عزوجل) iss raat me tamaan musalmano ki magfirat farma deta hai. Siwa ye - Mushrik, Kaafir, Jaadugar,  Najumi, zaani, Sharabi, Kinah pur, sud khawar, ma baap ki nafarmaani karne wala aur rishta qataw(todne) karne wala ke.",
        "hawala": " Tafseer e kabir"
      },
      {
        "id": "sb13",
        "category":"Amal",
        "details": "15 Shaban Ul Muazzam Baad Namaaz e Maghrib me ye amal karna behtar hai: \n\n\t 1) 2 Raka'at nafl namaaz: Daraazi e umar bil khar ki niyat se.\n\t 2) 2 Raka'at nafl namaaz: Daf'e balaa ki niyat se.\n\t 3) 2 Raka'at Makhluq ka mohtaj na hone ki niyat se.\n\t Har do raka'at ke darmian 1 baar surah Ya Seen aur 1 bar dua nisf e Shaban padhe.",
        "hawala":"",
        "title": "15 Shaban Ul Muazzam Baad Namaaz e Maghrib"
      },
      {
        "id": "sb13",
        "category":"Amal",
        "hawala":"",
        "title": "Shab e Barat me Beri k patta se ghusal",
        "details": "Iss raat ko jo shaksh 7 beri ke patte paani mein josh(yaani halka garam kar kar) ghusal karein ان شا الله tamaam saal jaadu ke asar se mahfooz rahega."
      },
      {
        "id": "sb13",
        "category":"Amal",
        "hawala":"",
        "title": "Qabristaan mein Haazri",
        "details": "Iss shab me Qabristaan jaana sarkare madina(ﷺ) ki sunnat hai. Lihaza tamaam mard hazrat iss ba barkat shab mein qabron ki ziyarat ko jaaye aur apne marhumin ko khub isaal e sawab kare."
      }, 
      {
        "id":"sb1",
        "category":"Hadis",
        "title": "Bhalaiyon ki darwaje khulne ki raat",
        "details": "Hamare piyare Aaqaa makki madani Mustafa(ﷺ) ne farmaya: Allah(عزوجل) karim 4 raaton mein bhalaion ke darwaje khol deta hai. \n\t 1) Baqrah Eid ki raat\n\t 2) Eid Ul Fitr ki raat\n\t 3) Shaban ki 15 wi raat - us raat me marne walon ke naam, logon ka rizq aur haj karne walon ke naam likhe jaate hai. \n\t 4) Arfah(yani 9 zil hijja) ki raat.",
        "hawala": "Tafsir e Mansur, Surah Dukhan, Ayaat(1-5). Jild 7, Safah:402. SHAB E BARAT KE FAZAIL - Dawat e Islami"
      },
      {
        "id":"sb1",
        "category":"Fazail",
        "title":"Shab e Barat ki 5 khususiat",
        "details": "Imaam Fakhruddin Razi(رَحمۃُ اللہ عَلَیْہ ) tafseer e Kabir me farmate hai: Shab e barat me 5 Khhususiat hai: \n\t 1) Iss raat har hikmat wala kaam bant dia jataa hai. Maslan ayindah saal kaise kitni rozi di jayegi, kon Khush nasib haj kare ga, kon marega, kon zindah rahega, wagerah sab kuch fariston ko bataa kar uss kaam par un ki duty lagaa di jaati hai. \n\t 2) Uss raat mein ebadat ki khusisi fazail hai. Maslan: Allah(عزوجل) paak ke akhri nabi, Rasul e Akram(ﷺ) ne farmaya: jo bandah shab e baraat mein 100 raka'at nawafil padhe, Allah(عزوجل) uss ke paas 100 fariste bhejta hai. In mein se \n\t 30 fariste usse jannat ki basarat dete hai \n\t 30 fariste usse jahannam se azadi ki khush khabri sunate hai. \n\t 30 fariste usse duniawi aafat se nijat se bachate hai aur \n\t 10 fariste uss ki Shaitan se hifaajat karte hai.",
        "hawala": "Tafseer e Kabir, Para: 25, Surah: Dukhan, Ayat: 3, Jild: 9, Safah 653. SHAB E BARAT KE FAZAIL - Dawat e Islami"
      }
    ],
    "name": "Shab e berat"
  }